<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b9e8df8ab5304c31b600b6a9753a5cddc55c097345352a0c230abcec9edfa312","plan_job_ref":"Job Create terraform plan #18 at https://github.com/leonitousconforti/infra/actions/runs/15420272884","plan_out_hash":"73d3c8cb677b8da3647e275497ad3487f08372312ff62d3dc7120228efe8f87d","plan_hash":"df8a55371f1492829d2dc799069ea6aeba3ed6afab090c92df15d1e006d6c5bf","plan_text_format":"diff","version":"2.0.0"} -->
Terraform plan in __ltgk.net__<details open><summary>With variables</summary>

```hcl
do_token           = (sensitive value)
porkbun_api_key    = (sensitive value)
porkbun_secret_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 12 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_domain.ltgk_net will be created
+   resource "digitalocean_domain" "ltgk_net" {
+       id   = (known after apply)
+       name = "ltgk.net"
+       ttl  = (known after apply)
+       urn  = (known after apply)
    }

  # digitalocean_droplet.gateway_ams3[0] will be created
+   resource "digitalocean_droplet" "gateway_ams3" {
+       backups              = false
+       created_at           = (known after apply)
+       disk                 = (known after apply)
+       droplet_agent        = true
+       graceful_shutdown    = false
+       id                   = (known after apply)
+       image                = "ubuntu-24-04-x64"
+       ipv4_address         = (known after apply)
+       ipv4_address_private = (known after apply)
+       ipv6                 = true
+       ipv6_address         = (known after apply)
+       locked               = (known after apply)
+       memory               = (known after apply)
+       monitoring           = true
+       name                 = "gateway.ams3.ltgk.net"
+       price_hourly         = (known after apply)
+       price_monthly        = (known after apply)
+       private_networking   = (known after apply)
+       region               = "ams3"
+       resize_disk          = true
+       size                 = "s-1vcpu-1gb"
+       ssh_keys             = [
+           "47660013",
        ]
+       status               = (known after apply)
+       tags                 = [
+           "gateway",
        ]
+       urn                  = (known after apply)
+       vcpus                = (known after apply)
+       volume_ids           = (known after apply)
+       vpc_uuid             = "8118626f-7bc0-432e-9efb-5b97d1c3501f"
    }

  # digitalocean_project_resources.ltgk_net_project will be created
+   resource "digitalocean_project_resources" "ltgk_net_project" {
+       id        = (known after apply)
+       project   = "acf5abcc-4976-4233-9832-7c7ca3efea5a"
+       resources = (known after apply)
    }

  # digitalocean_record.dmarc will be created
+   resource "digitalocean_record" "dmarc" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "_dmarc"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DMARC1; p=quarantine; rua=mailto:25f8c5e6@mxtoolbox.dmarc-report.com; ruf=mailto:25f8c5e6@forensics.dmarc-report.com; fo=1"
    }

  # digitalocean_record.domainkey will be created
+   resource "digitalocean_record" "domainkey" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "default._domainkey"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=DKIM1; k=rsa; p=MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC8158yxaFjZYq/gcbZ9pfsLcq7pkABLfl8q1AXWbAMpgZSUdpw1o/CKSHmVpnYL9pwLTYvLxpN9W8DkO5lSRFWxP/ljKCX/rJzSJ28MwI7UuPjbWpG43/zdIJc9yUP8F9ulmumnVinMEvQPVW49u1RPSDeCovTMWCrLXeRrRE86wIDAQAB"
    }

  # digitalocean_record.gateway_ams3_AAAA_record will be created
+   resource "digitalocean_record" "gateway_ams3_AAAA_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.ams3"
+       ttl    = 3600
+       type   = "AAAA"
+       value  = (known after apply)
    }

  # digitalocean_record.gateway_ams3_A_record will be created
+   resource "digitalocean_record" "gateway_ams3_A_record" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "gateway.ams3"
+       ttl    = 3600
+       type   = "A"
+       value  = (known after apply)
    }

  # digitalocean_record.mx1 will be created
+   resource "digitalocean_record" "mx1" {
+       domain   = "ltgk.net"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 10
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd1.porkbun.com."
    }

  # digitalocean_record.mx2 will be created
+   resource "digitalocean_record" "mx2" {
+       domain   = "ltgk.net"
+       fqdn     = (known after apply)
+       id       = (known after apply)
+       name     = "@"
+       priority = 20
+       ttl      = 600
+       type     = "MX"
+       value    = "fwd2.porkbun.com."
    }

  # digitalocean_record.sfp will be created
+   resource "digitalocean_record" "sfp" {
+       domain = "ltgk.net"
+       fqdn   = (known after apply)
+       id     = (known after apply)
+       name   = "@"
+       ttl    = 300
+       type   = "TXT"
+       value  = "v=spf1 include:_spf.porkbun.com ~all"
    }

  # digitalocean_reserved_ip.gateway_ams3_reserved_ip will be created
+   resource "digitalocean_reserved_ip" "gateway_ams3_reserved_ip" {
+       droplet_id = (known after apply)
+       id         = (known after apply)
+       ip_address = (known after apply)
+       region     = "ams3"
+       urn        = (known after apply)
    }

  # porkbun_domain_nameservers.ltgk_net_nameservers will be created
+   resource "porkbun_domain_nameservers" "ltgk_net_nameservers" {
+       domain      = "ltgk.net"
+       nameservers = [
+           "ns1.digitalocean.com",
+           "ns2.digitalocean.com",
+           "ns3.digitalocean.com",
        ]
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #18](https://github.com/leonitousconforti/infra/actions/runs/15420272884)